In [1]:
import pandas as pd
import xlrd
import numpy as np

In [2]:
df = pd.read_excel("Canada.xlsx")
df.columns.values

array(['Type', 'Coverage', 'OdName', 'AREA', 'AreaName', 'REG', 'RegName',
       'DEV', 'DevName', 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013], dtype=object)

In [3]:
df_new = df[['AreaName', 1980, 1981]]
df_new = df_new.head(5)

In [4]:
df_new

  AreaName  1980  1981
0     Asia    16    39
1   Europe     1     0
2   Africa    80    67
3  Oceania     0     1
4   Europe     0     0

#### Creating few Null Values

In [5]:
df_new.loc[4,"AreaName"] = np.nan
df_new.loc[3,1980] = np.nan
df_new.loc[2,1981] = np.nan

In [6]:
df_new

  AreaName  1980  1981
0     Asia  16.0  39.0
1   Europe   1.0   0.0
2   Africa  80.0   NaN
3  Oceania   NaN   1.0
4      NaN   0.0   0.0

# fillna() on Entire DataFrame

#### All null values in entire DataFrame will be filled with same specified value

In [7]:
df_new.fillna(100, inplace=True)

#### All null values are filled with 100. But for column "AreaName" 100 is not logical. So need to be careful

In [8]:
df_new

  AreaName   1980   1981
0     Asia   16.0   39.0
1   Europe    1.0    0.0
2   Africa   80.0  100.0
3  Oceania  100.0    1.0
4      100    0.0    0.0

# fillna() on Column

In [9]:
df_new = df[['AreaName', 1980, 1981]]
df_new = df_new.head(5)
df_new.loc[4,"AreaName"] = np.nan
df_new.loc[3,1980] = np.nan
df_new.loc[2,1981] = np.nan

In [10]:
df_new

  AreaName  1980  1981
0     Asia  16.0  39.0
1   Europe   1.0   0.0
2   Africa  80.0   NaN
3  Oceania   NaN   1.0
4      NaN   0.0   0.0

In [11]:
df_new["AreaName"].fillna("New Area", inplace=True)

In [12]:
df_new

   AreaName  1980  1981
0      Asia  16.0  39.0
1    Europe   1.0   0.0
2    Africa  80.0   NaN
3   Oceania   NaN   1.0
4  New Area   0.0   0.0

In [13]:
df_new[1980].fillna(5000, inplace=True)

In [14]:
df_new

   AreaName    1980  1981
0      Asia    16.0  39.0
1    Europe     1.0   0.0
2    Africa    80.0   NaN
3   Oceania  5000.0   1.0
4  New Area     0.0   0.0

In [15]:
df_new[1981].fillna(6000, inplace=True)

In [16]:
df_new

   AreaName    1980    1981
0      Asia    16.0    39.0
1    Europe     1.0     0.0
2    Africa    80.0  6000.0
3   Oceania  5000.0     1.0
4  New Area     0.0     0.0